app/controllers/home_controller.rb

  def index
    # InstagramImage.delete_all
    InstagramWorker.perform_async("trout")
    @images = InstagramImage.all
---
SELECT "instagram_images".* FROM "instagram_images"